In [ ]:
#jo apkay pass dat hae pandas ussko kesay rakhta hae 
#wo pandas data structre hae.

In [3]:
import pandas as pd

# Pandas Data structures Series Dataframe
#####series#####

In [3]:
#series is a sequence of number
s1 = pd.Series([11,22,33,44,55,66,77,88,99,10])
s1 # pandas series object

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [4]:
#index (0_9 default index given by series object)

In [5]:
s1[9] #accessing value by index

10

In [7]:
s1[2,4,7,9,0]

KeyError: (2, 4, 7, 9, 0)

In [6]:
s1[[2,4,7,9,0]] #accessing multiple values

2    33
4    55
7    88
9    10
0    11
dtype: int64

In [8]:
s1[5]=5555 # modifying value in a series

In [9]:
s1

0      11
1      22
2      33
3      44
4      55
5    5555
6      77
7      88
8      99
9      10
dtype: int64

In [10]:
del s1[5] #deleting value in a series

In [11]:
s1

0    11
1    22
2    33
3    44
4    55
6    77
7    88
8    99
9    10
dtype: int64

In [12]:
s1[[2,3,0,4]]=[23,45,67,78]# modify multiple values
s1

0    67
1    22
2    23
3    45
4    78
6    77
7    88
8    99
9    10
dtype: int64

In [14]:
del s1[[2,3,0]]
s1

TypeError: '[2, 3, 0]' is an invalid key

In [15]:
s1[99]=999#insert in a series with a new index
#agar 99 index empty hae he to value insert hogi warna replace ho jay gi
s1

0      67
1      22
2      23
3      45
4      78
6      77
7      88
8      99
9      10
99    999
dtype: int64

In [17]:
s1[[22,33]]=22,33#multiple insert and multiple
#delete is not allowed

ValueError: [22 33] not contained in the index

In [20]:
s2 =pd.Series([10,20,30,40],index=["orange","apples","bananas","kwi"])

In [22]:
s2

orange     10
apples     20
bananas    30
kwi        40
dtype: int64

In [23]:
s2.index

Index(['orange', 'apples', 'bananas', 'kwi'], dtype='object')

In [24]:
#index is a key in a series like dictionary
#key/index can be a number or string.

In [26]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [27]:
ourindex=["orange","apples","bananas","kwi"]
s3=pd.Series([10,20,30,40],ourindex)
s3

orange     10
apples     20
bananas    30
kwi        40
dtype: int64

In [29]:
s3["orrange"]=290
s3

orange     290
apples      20
bananas     30
kwi         40
orrange    290
dtype: int64

In [30]:
s3["apple"]=990
s3

orange     290
apples      20
bananas     30
kwi         40
orrange    290
apple      990
dtype: int64

In [32]:
s3["kwi"]

40

In [33]:
s2>30

orange     False
apples     False
bananas    False
kwi         True
dtype: bool

In [34]:
s2[s2<30]

orange    10
apples    20
dtype: int64

In [35]:
s2<30

orange      True
apples      True
bananas    False
kwi        False
dtype: bool

In [36]:
s2[s2>30]

kwi    40
dtype: int64

In [37]:
s2==30

orange     False
apples     False
bananas     True
kwi        False
dtype: bool

In [38]:
s2[s2==30]

bananas    30
dtype: int64

In [39]:
"peach" in s2 #checking if required key is in series or not

False

In [40]:
"apples" in s2#checking if required key is in series or not

True

# Creating a series by using dictionary

In [42]:
sdata ={"ohio":3500,"Texas":71000,"Oregon":16000,"Utah":5000}
data= pd.Series(sdata)
data

ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [43]:
states =["california","ohio","Oregon","Texas"]
data1=pd.Series(sdata,index=states)
data1
#NaN =not a number/missing value
#by default value float hogi q kay explain 
#nahi kiya kay data type kiya hae bus kaha uthalo

california        NaN
ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [45]:
data1.isnull()

california    False
ohio          False
Oregon        False
Texas         False
dtype: bool

In [46]:
data1.notnull()

california    True
ohio          True
Oregon        True
Texas         True
dtype: bool

In [44]:

data1["california"]=487900
data1

california    487900.0
ohio            3500.0
Oregon         16000.0
Texas          71000.0
dtype: float64

# DATA FRAMES

In [47]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],      
        'year': [2000, 2001, 2002, 2001, 2002, 2003],       
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
#all columns is equal in  all keys its important

In [49]:
data1 ={"Authors":["Ali","Hassan","Hussain","Fatima"],
        "Books":["AI for everyone","Python for data analysis","Numpy Basics","Anaconda"],
       "Stock":[3,5,6,7]}
df2=pd.DataFrame(data1)
df2

   Authors                     Books  Stock
0      Ali           AI for everyone      3
1   Hassan  Python for data analysis      5
2  Hussain              Numpy Basics      6
3   Fatima                  Anaconda      7

In [50]:
type(df1)

pandas.core.frame.DataFrame

In [51]:
df1.shape

(6, 3)

In [52]:
df1['pop']#select single column by column header

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [53]:
df1.pop#its not good

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [54]:
df1[["pop","state"]]#selecting multiple columns by column header

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [55]:
del df1["pop"]
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [56]:
df1["debt"]=100

In [57]:
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   100
2    Ohio  2002   100
3  Nevada  2001   100
4  Nevada  2002   100
5  Nevada  2003   100

In [58]:
df1["Economy"]=[100,200,300,400,500,600]

In [59]:
df1

    state  year  debt  Economy
0    Ohio  2000   100      100
1    Ohio  2001   100      200
2    Ohio  2002   100      300
3  Nevada  2001   100      400
4  Nevada  2002   100      500
5  Nevada  2003   100      600

In [60]:
df1["debt"]=200

In [61]:
df1

    state  year  debt  Economy
0    Ohio  2000   200      100
1    Ohio  2001   200      200
2    Ohio  2002   200      300
3  Nevada  2001   200      400
4  Nevada  2002   200      500
5  Nevada  2003   200      600

In [62]:
df1["govt"]=range(6)
df1

    state  year  debt  Economy  govt
0    Ohio  2000   200      100     0
1    Ohio  2001   200      200     1
2    Ohio  2002   200      300     2
3  Nevada  2001   200      400     3
4  Nevada  2002   200      500     4
5  Nevada  2003   200      600     5

In [64]:
df1["currency"]=df2["Stock"]
df1

    state  year  debt  Economy  govt  currency
0    Ohio  2000   200      100     0       3.0
1    Ohio  2001   200      200     1       5.0
2    Ohio  2002   200      300     2       6.0
3  Nevada  2001   200      400     3       7.0
4  Nevada  2002   200      500     4       NaN
5  Nevada  2003   200      600     5       NaN

In [4]:
df1 = {
     "Ai for EO":[78,89,98,90,87,86,67,89],
     "Python1":[90,91,67,89,45,66,89,92],
     "Python2":[89,78,87,88,90,98,81,93]}
df = pd.DataFrame(df1,index=["Nasir","Asad","Ramsha","Mansor","Saba",
                             "Saba","Hina","Ali"])
df

        Ai for EO  Python1  Python2
Nasir          78       90       89
Asad           89       91       78
Ramsha         98       67       87
Mansor         90       89       88
Saba           87       45       90
Saba           86       66       98
Hina           67       89       81
Ali            89       92       93

In [87]:
df["TotalMarks"]=df["Ai for EO"]+df["Python1"]+df["Python2"]
df

        Ai for EO  Python1  Python2  Total Marks  TotalMarks
Nasir          78       90       89          257         257
Asad           89       91       78          258         258
Ramsha         98       67       87          252         252
Mansor         90       89       88          267         267
Saba           87       45       90          222         222
Saba           86       66       98          250         250
Hina           67       89       81          237         237
Ali            89       92       93          274         274

In [81]:
for val in df["Total Marks"].values:
        if(val>200):
               print("Pass")
        else:
               print("Fail")

Pass
Pass
Pass
Pass
Pass
Pass
Pass
Pass

In [83]:
#df["status"]=
numbers =[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
evenArr=[]
oddArr=[]
for num in numbers:
    if num%2==0:
        evenArr.append(num)
    else:
        oddArr.append(num)
print("Even>>",evenArr)
print("Odd>>",oddArr)

Even>> [2, 4, 6, 8, 10, 12, 14]
Odd>> [1, 3, 5, 7, 9, 11, 13, 15]

In [84]:
#list comprehension
[num for num in numbers if num%2==0]

[2, 4, 6, 8, 10, 12, 14]

In [8]:
import numpy as np

In [12]:
df6 = {
     "Ai for EO":[78,89,98,90,87,86,67,89],
     "Python1":[90,91,67,89,45,66,89,92],
     "Python2":[89,78,87,88,90,98,81,93]}
df7 = pd.DataFrame(df6,index=["Nasir","Asad","Ramsha","Mansor","Saba",
                             "Saba","Hina","Ali"])
df7

        Ai for EO  Python1  Python2
Nasir          78       90       89
Asad           89       91       78
Ramsha         98       67       87
Mansor         90       89       88
Saba           87       45       90
Saba           86       66       98
Hina           67       89       81
Ali            89       92       93

In [13]:
df7['status']=np.where(((df["Ai for EO"]<50)&(df["Python1"]<50)&(df["Python2"]<50)))
df7

ValueError: Length of values does not match length of index

In [ ]:
df["Status"]=["Pass" if marks>=200 else "Fail" for marks in df.TotalMarks]

In [89]:
df

        Ai for EO  Python1  Python2  Total Marks  TotalMarks Status
Nasir          78       90       89          257         257   Pass
Asad           89       91       78          258         258   Pass
Ramsha         98       67       87          252         252   Pass
Mansor         90       89       88          267         267   Pass
Saba           87       45       90          222         222   Pass
Saba           86       66       98          250         250   Pass
Hina           67       89       81          237         237   Pass
Ali            89       92       93          274         274   Pass

In [92]:
df["percentage"]=[(tot/300)*100 for tot in df.TotalMarks]

In [93]:
df

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage
Nasir,78,90,89,257,257,Pass,85.666667
Asad,89,91,78,258,258,Pass,86.000000
Ramsha,98,67,87,252,252,Pass,84.000000
Mansor,90,89,88,267,267,Pass,89.000000
Saba,87,45,90,222,222,Pass,74.000000
Saba,86,66,98,250,250,Pass,83.333333
Hina,67,89,81,237,237,Pass,79.000000
Ali,89,92,93,274,274,Pass,91.333333

In [94]:
df[["Ai for EO","Python1","Python2"]]

        Ai for EO  Python1  Python2
Nasir          78       90       89
Asad           89       91       78
Ramsha         98       67       87
Mansor         90       89       88
Saba           87       45       90
Saba           86       66       98
Hina           67       89       81
Ali            89       92       93

In [99]:
df["Status2"]=["Pass" if a>=33 and p1>=33 and p2>=33 else "Fail" 
               for a,p1,p2 in zip(df["Ai for EO"],df["Python1"],df["Python2"])]

In [100]:
df

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Nasir,78,90,89,257,257,Pass,85.666667,Pass
Asad,89,91,78,258,258,Pass,86.000000,Pass
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass
Hina,67,89,81,237,237,Pass,79.000000,Pass
Ali,89,92,93,274,274,Pass,91.333333,Pass

In [96]:
a=[2,3,4,56,8]
b=[3,5,6,7,9]
c=zip(a,b)
for i in c:
    print(i)

(2, 3)
(3, 5)
(4, 6)
(56, 7)
(8, 9)

In [101]:
df["Status3"]=["Pass" if a>=33 and p1>=33 and p2>=33 else "Fail" 
               for a,p1,p2 in df[["Ai for EO","Python1","Python2"]]]
df

ValueError: too many values to unpack (expected 3)

In [5]:
df["Status4"]=["Pass" if a>=33 and p1>=33 and p2>=33 else "Fail" 
               for a,p1,p2 in (df["Ai for EO"],df["Python1"],df["Python2"])]

ValueError: too many values to unpack (expected 3)

In [102]:
#by default head 5 rows return karta hae upper ki
df.head()

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Nasir,78,90,89,257,257,Pass,85.666667,Pass
Asad,89,91,78,258,258,Pass,86.000000,Pass
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass

In [ ]:
df["status"] = np.where(d)

In [110]:
df.head(6)

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Nasir,78,90,89,257,257,Pass,85.666667,Pass
Asad,89,91,78,258,258,Pass,86.000000,Pass
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass

In [104]:
df.tail()#tail by default neechay ki 5 rows leta hae

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass
Hina,67,89,81,237,237,Pass,79.000000,Pass
Ali,89,92,93,274,274,Pass,91.333333,Pass

In [111]:
df.tail(6)

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass
Hina,67,89,81,237,237,Pass,79.000000,Pass
Ali,89,92,93,274,274,Pass,91.333333,Pass

In [105]:
#by default tail bhi 5 rows return karti hae neechay ki

In [106]:
df.loc["Saba"]

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass

In [107]:
df.loc["Nasir"]

Ai for EO           78
Python1             90
Python2             89
Total Marks        257
TotalMarks         257
Status            Pass
percentage     85.6667
Status2           Pass
Name: Nasir, dtype: object

In [108]:
df.loc["Nasir":"Hina"]#slicing
#hina ko bhi include karay ga

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Nasir,78,90,89,257,257,Pass,85.666667,Pass
Asad,89,91,78,258,258,Pass,86.000000,Pass
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass
Hina,67,89,81,237,237,Pass,79.000000,Pass

In [109]:
df.iloc[0:6]#exclude 6 and take only 5

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Nasir,78,90,89,257,257,Pass,85.666667,Pass
Asad,89,91,78,258,258,Pass,86.000000,Pass
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass

In [112]:
df.iloc[::-1]

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Ali,89,92,93,274,274,Pass,91.333333,Pass
Hina,67,89,81,237,237,Pass,79.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Asad,89,91,78,258,258,Pass,86.000000,Pass
Nasir,78,90,89,257,257,Pass,85.666667,Pass

In [113]:
df.loc["Nasir"]["Python2"]

89

In [116]:
df.loc["abc"]=[67,89,78,88,99,"Pass",89.98,"Pass"]

In [117]:
df

,Ai for EO,Python1,Python2,Total Marks,TotalMarks,Status,percentage,Status2
Nasir,78,90,89,257,257,Pass,85.666667,Pass
Asad,89,91,78,258,258,Pass,86.000000,Pass
Ramsha,98,67,87,252,252,Pass,84.000000,Pass
Mansor,90,89,88,267,267,Pass,89.000000,Pass
Saba,87,45,90,222,222,Pass,74.000000,Pass
Saba,86,66,98,250,250,Pass,83.333333,Pass
Hina,67,89,81,237,237,Pass,79.000000,Pass
Ali,89,92,93,274,274,Pass,91.333333,Pass
abc,67,89,78,88,99,Pass,89.980000,Pass